backend/views/account/_search.php

            <?= $form->field($model, 'account_type')->dropDownList(['customer' => 'Customer', 'seller' => 'Seller'], ['prompt' => 'Select Type']) ?>
        </div>
        <div class="col-sm-3">
            <?= $form->field($model, 'country')->dropDownList(\yii\helpers\ArrayHelper::map(\app\models\Country::find()->all(), 'id', 'country_name'), ['prompt' => 'Select Country']) ?>
---
SELECT * FROM `country`