backend/controllers/FileManagerController.php

SELECT * FROM `media_manager` WHERE (`type`='folder') AND (`parent_id`='0')
SELECT * FROM `media_manager` WHERE (`type`='file') AND (`parent_id`='0')
---
    public function getRootFoldersFiles($type) {

        $folderInfo = null;

        if ($type == 'folder') {
            $folderInfo = MediaManager::find()->where(['type' => 'folder', 'parent_id' => '0'])->all();
        } elseif ($type == 'file') {
            $folderInfo = MediaManager::find()->where(['type' => 'file', 'parent_id' => '0'])->all();