backend/views/site/index.php

SELECT COUNT(*) FROM `items` WHERE `status`=2
---
                    <div class="col-xs-7">
                        <div class="numbers">
                            <p>Await Approval</p>
                            <?= Items::find()->where(['status' => 2])->count() ?>

SELECT COUNT(*) FROM `items` WHERE `status`=1
---
                    <div class="col-xs-7">
                        <div class="numbers">
                            <p>Active Items</p>
                            <?= Items::find()->where(['status' => 1])->count() ?>

SELECT COUNT(*) FROM `accounts` WHERE `account_type`='customer'
---
                    <div class="col-xs-7">
                        <div class="numbers">
                            <p>Customers</p>
                            <?= Accounts::find()->where(['account_type' => 'customer'])->count() ?>

SELECT COUNT(*) FROM `accounts` WHERE `account_type`='seller'
---
                    <div class="col-xs-7">
                        <div class="numbers">
                            <p>Sellers</p>
                            <?= Accounts::find()->where(['account_type' => 'seller'])->count() ?>