backend/views/item/_form.php

                </div>
                <div class="tab-pane" id="profile-2">

                    <?= $form->field($model, 'seller_id')->dropDownList(
                        ArrayHelper::map(Accounts::find()->all(), 'id', function($model) {
                            return $model->first_name . ' '. $model->last_name;
                        })
                    , ['prompt' => 'Select Seller']) ?>

                    <?= $form->field($model, 'category_id')->dropDownList( ArrayHelper::map( Categories::find()->all(), 'id', 'name' ), ['prompt' => 'Select Category']) ?>
---
SELECT * FROM `accounts`
SELECT * FROM `categories`