backend/views/item/_search.php

            <?= $form->field($model, 'price') ?>
        </div>
        <div class="col-sm-3">
            <?= $form->field($model, 'seller_id')->dropDownList(ArrayHelper::map(Accounts::find()->where(['status' => 1])->all(), 'id', 'email'), ['prompt' => 'Select Seller']) ?>
        </div>
        <div class="col-sm-3">
            <?= $form->field($model, 'category_id')->dropDownList(ArrayHelper::map(Categories::find()->all(), 'id', 'name'), ['prompt' => 'Select Category']) ?>
---
SELECT * FROM `accounts` WHERE `status`=1
SELECT * FROM `categories`

    <div class="row">

        <div class="col-sm-3">
            <?php echo $form->field($model, 'area_id')->dropDownList(ArrayHelper::map(Areas::find()->all(), 'id', 'name'), ['prompt' => 'Select Area']) ?>
---
SELECT * FROM `areas`